tutorials/incompressible/pimpleSolver/laminar/oscillatingInletACMI2D/system/topoSetDict
/*---------------------------------------------------------------------------*
Caelus 9.04
Web:   www.caelus-cml.com
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
    // Get both sides of ami
    // ~~~~~~~~~~~~~~~~~~~~~

    // Create faceZone for patch couple1
    {
        name    couple1Faces;
        type    faceSet;
        action  new;
        source  patchToFace;
        sourceInfo
        {
            name    couple1;
        }
    }
    {
        name    couple1Faces;
        type    faceZoneSet;
        action  new;
        source  setToFaceZone;
        sourceInfo
        {
            faceSet couple1Faces;
        }
    }

    // Create faceZone for patch couple2
    {
        name    couple2Faces;
        type    faceSet;
        action  new;
        source  patchToFace;
        sourceInfo
        {
            name    couple2;
        }
    }
    {
        name    couple2Faces;
        type    faceZoneSet;
        action  new;
        source  setToFaceZone;
        sourceInfo
        {
            faceSet couple2Faces;
        }
    }

    // Create cellZone for moving cells in inlet channel
    {
        name    inletChannel;
        type    cellSet;
        action  new;
        source  boxToCell;
        sourceInfo
        {
            box     (-100 -100 -100) (1.0001 100 100);
        }
    }
    {
        name    inletChannel;
        type    cellZoneSet;
        action  new;
        source  setToCellZone;
        sourceInfo
        {
            set     inletChannel;
        }
    }
);

// ************************************************************************* //
